Repository: Narzgul/piri-backend
Catalog: Recode/po/*.po
Languages: hu

source: No error
hu: Hib�tlan

source: Non canonical input
hu: Nem kanonikus bemenet

source: Ambiguous output
hu: Nem egy�rtelm� kimenet

source: Untranslatable input
hu: Leford�thatatlan bemenet

source: Invalid input
hu: �rv�nytelen bemenet

source: System detected problem
hu: Rendszerhiba

source: Misuse of recoding library
hu: Az �tk�dol�k�nyvt�r t�ves haszn�lata

source: Internal recoding bug
hu: Bels� �tk�dol�si hiba

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
hu: Ez a program szabad szoftver; terjeszthet� �s/vagy m�dos�that� a Free Software Foundation �ltal k�zz�tett GNU General Public License felt�teleinek megfelel�en. A licencszerz�d�s 2. vagy (szabadon v�laszthat�an) b�rmelyik k�s�bbi v�ltozata haszn�lhat�. A programot abban a rem�nyben adjuk k�zre, hogy hasznosnak bizonyul, de NINCS SEMMI GARANCIA; bele�rtve a K�ZREADHAT�S�GGAL vagy EGY BIZONYOS C�LRA VAL� ALKALMASS�GGAL kapcsolatos garanci�t is. Tov�bbi r�szletek�rt olvasd el a GNU General Public License teljes sz�veg�t. A programmal egy�tt meg kellett kapnod a GNU General Public License egy p�ld�ny�t. Ha nem kaptad meg, �rj a Free Software Foundation-nek a k�vetkez� c�mre: 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: Try `%s %s' for more information.
hu: Tov�bbi inform�ci��rt �rd be: `%s %s'.

source: Usage: %s [OPTION]... [ [CHARSET] | REQUEST [FILE]... ]
hu: Haszn�lat: %s [KAPCSOL�K]... [ [KARAKTERK�SZLET] | K�R�S [F�JL]... ]

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
hu: Ha a hossz� kapcsol�hoz k�telez� argumentumot �rni, akkor az a megfelel� r�vid kapcsol�ra is vonatkozik. Hasonl� a helyzet a v�laszthat� argumentumokkal.

source: Listings: -l, --list[=FORMAT] list one or all known charsets and aliases -k, --known=PAIRS restrict charsets according to known PAIRS list -h, --header[=[LN/]NAME] write table NAME on stdout using LN, then exit -F, --freeze-tables write out a C module holding all tables -T, --find-subsets report all charsets being subset of others -C, --copyright display Copyright and copying conditions --help display this help and exit --version output version information and exit
hu: List�k: -l, --list[=FORM�TUM] ki�rja az �sszes ismert karakterk�szletet -k, --known=PAIRS restrict charsets according to known PAIRS list -h, --header[=[LN/]NAME] write table NAME on stdout using LN, then exit -F, --freeze-tables write out a C module holding all tables -T, --find-subsets ki�rja azokat a karakterk�szleteket, amelyeket m�sok magukba foglalnak -C, --copyright ki�rja a copyrightot �s a m�sol�s felt�teleit --help ki�rja ezt a s�g�t �s kil�p --version ki�rja a verzi�inform�ci�kat �s kil�p

source: Operation modes: -v, --verbose explain sequence of steps and report progress -q, --quiet, --silent inhibit messages about irreversible recodings -f, --force force recodings even when not reversible -t, --touch touch the recoded files after replacement -i, --sequence=files use intermediate files for sequencing passes --sequence=memory use memory buffers for sequencing passes
hu: M�k�d�si m�dok: -v, --verbose ki�rja a l�p�seket �s az el�rehalad�st -q, --quiet, --silent nem �r ki �zeneteket visszaford�thatatlan �tk�dol�s eset�n -f, --force �tk�dol�s k�nyszer�t�se visszaford�thatatlan esetben is -t, --touch az �tk�dolt f�jlok d�tum�t m�dos�tja -i, --sequence=files k�zb�ls� f�jlokat haszn�l az egym�st k�vet� l�p�sekhez --sequence=memory mem�ri�ban elhelyezked� t�rol�kat haszn�l az egym�st k�vet� l�p�sekhez

source: -p, --sequence=pipe use pipe machinery for sequencing passes
hu: -p, --sequence=pipe cs�vezet�keket haszn�l az egym�st k�vet� l�p�sekhez

source: -p, --sequence=pipe same as -i (on this system)
hu: -p, --sequence=pipe ugyanaz, mint a -i (ezen a rendszeren)

source: Fine tuning: -s, --strict use strict mappings, even loose characters -d, --diacritics convert only diacritics or alike for HTML/LaTeX -S, --source[=LN] limit recoding to strings and comments as for LN -c, --colons use colons instead of double quotes for diaeresis -g, --graphics approximate IBMPC rulers by ASCII graphics -x, --ignore=CHARSET ignore CHARSET while choosing a recoding path
hu: Finomhangol�s: -s, --strict szigor� lek�pez�s haszn�lata, ak�r karakterveszt�s �r�n is -d, --diacritics csak a nemzeti karaktereket k�dolja �t HTML/LaTeX form�tumhoz -S, --source[=NYELV] csak a NYELV �ltal meghat�rozott karakterl�ncokat �s megjegyz�seket k�dolja �t -c, --colons `:' haszn�lata a `"' helyett a k�tpontos �kezet jel�l�s�re az Easy French (egyfajta rep�l� �kezet) k�dol�sban -g, --graphics az IBMPC vonalrajzol� karakterek helyettes�t�se ASCII grafik�val -x, --ignore=KARK�SZL a KARK�SZL mell�z�se �tk�dol�si �tvonal v�laszt�s�n�l

source: LN is some language, it may be `c', `perl' or `po'; `c' is the default.
hu: A NYELV valamilyen programnyelv, lehet `c', `perl' vagy `po'; a `c' az alap- �rtelmezett.

source: Report bugs to <recode-bugs@iro.umontreal.ca>.
hu: A hib�kat jelentsd a <recode-bugs@iro.umontreal.ca> c�men.

source: Sequence `%s' is ambiguous
hu: A sorozat nem egy�rtelm�: `%s'

source: Sequence `%s' is unknown
hu: A sorozat ismeretlen: `%s'

source: Language `%s' is ambiguous
hu: A nyelv nem egy�rtelm�: `%s'

source: Language `%s' is unknown
hu: A nyelv ismeretlen: `%s'

source: Format `%s' is ambiguous
hu: A form�tum nem egy�rtelm�: `%s'

source: Format `%s' is unknown
hu: A form�tum ismeretlen: `%s'

source: Written by Franc,ois Pinard <pinard@iro.umontreal.ca>.
hu: �rta Fran�ois Pinard <pinard@iro.umontreal.ca>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
hu: Ez szabad szoftver; l�sd a forr�st a terjeszt�si felt�telek�rt. Nincs garancia, m�g az eladhat�s�gra vagy egy adott c�lra val� megfelel�sre sem.

source: Symbol `%s' is unknown
hu: A jel ismeretlen: `%s'

source: Charset `%s' is unknown or ambiguous
hu: A karakterk�szlet ismeretlen vagy nem egy�rtelm�: `%s'

source: Required argument is missing
hu: Hi�nyzik egy k�telez� argumentum

source: Syntax is deprecated, please prefer `%s'
hu: A szintaxis elavult, haszn�ld ink�bb ezt: `%s'

source: Request `%s' is erroneous
hu: A k�r�s hib�s: `%s'

source: Recoding %s...
hu: %s �tk�dol�sa...

source: done
hu: k�sz

source: failed: %s in step `%s..%s'
hu: sikertelen: %s a `%s..%s' l�p�sben

source: %s failed: %s in step `%s..%s'
hu: %s sikertelen: %s a `%s..%s' l�p�sben

source: %s in step `%s..%s'
hu: %s a `%s..%s' l�p�sben

source: Charset %s already exists and is not %s
hu: %s karakterk�szlet m�r l�tezik �s nem %s.

source: Virtual memory exhausted
hu: A virtu�lis mem�ria betelt

source: Codes %3d and %3d both recode to %3d
hu: A %3d �s %3d k�dok egyar�nt %3d k�dra v�ltoznak

source: No table to print
hu: Nincs nyomtathat� t�bl�zat

source: reversible
hu: visszaford�that�

source: %s to %s
hu: %s -> %s

source: variable
hu: v�ltoz�

source: *Unachievable*
hu: *lehetetlen*

source: *mere copy*
hu: *egyszer� m�sol�s*

source: Virtual memory exhausted!
hu: A virtu�lis mem�ria betelt!

source: Request: %s
hu: K�r�s: %s

source: Shrunk to: %s
hu: Sz�k�tve erre: %s

source: Unrecognised surface name `%s'
hu: Ismeretlen fel�letn�v `%s'

source: No way to recode from `%s' to `%s'
hu: Nem lehets�ges az �tk�dol�s `%s' �s `%s' k�z�tt.

source: Expecting `..' in request
hu: `..'-t kell megadni a k�r�sben

source: Child process wait status is 0x%0.2x
hu: A gyermekfolyamat v�rakoz�si �llapota 0x%0.2x

source: UCS2 Mne Description
hu: UCS2 Mne le�r�s
